src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_МониторингОшибокСтатистика/КИИ_МониторингОшибокСтатистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокСтатистика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КИИ_МоделиИИ/КИИ_МоделиИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_МоделиИИ</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПоляТекста</name>
    <comment>Возможно content или text</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумТокенов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПровайдера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвторизации</name>
    <type>
      <types>EnumRef.КИИ_ТипыАвторизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФорматаAPI</name>
    <type>
      <types>EnumRef.КИИ_ТипыФорматовAPI</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЖизниКеша</name>
    <comment>TTL для записей кеша ответов ИИ в секундах. 0 = не использовать кеш для модели. Дефолт 86400 (24ч).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыКеша</name>
    <comment>Версия контракта нормализации ключа кеша для этой модели. Инкремент = все старые записи кеша протухли. Дефолт 1.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодели</name>
    <comment>Чат / Эмбеддинг — разделение chat vs embedding.</comment>
    <type>
      <types>EnumRef.КИИ_ТипыМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>EndpointЭмбеддингов</name>
    <comment>Напр. /v1/embeddings (если ТипМодели=Эмбеддинг).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерностьЭмбеддинга</name>
    <comment>1536/256.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксТокеновВхода</name>
    <comment>Лимит для чанкера.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассEgress</name>
    <comment>РФ/внешний — матчится с политикой документа.</comment>
    <type>
      <types>EnumRef.КИИ_ПолитикиЭмбеддинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживаетИнструменты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/КИИ_МониторингОшибок/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль: КИИ_МониторингОшибок
// Назначение: Подсистема мониторинга ошибок из журнала регистрации с анализом через ИИ
//
// Версия: 2.0
//
// Архитектура:
//   - Двухэтапная обработка: Сбор → Анализ ИИ (пакетный) → Дайджест/уведомления
//   - Дедупликация по MD5-хешу текста ошибки
//   - Пагинация чтения ЖР (защита от потери ошибок при большом потоке)
//   - Пакетный анализ ИИ (несколько ошибок за один запрос)
//   - Дайджест Telegram (сводка вместо спама индивидуальных сообщений)
//   - БезопасноеХранилище для токенов Telegram
//   - Автоматическая очистка устаревших данных
//   - Защита от параллелизма через БСП
//   - Используется КИИ_КоннекторИИ для запросов к ИИ
//   - Используется КИИ_TelegramУведомления для отправки уведомлений
//
// Необходимые объекты метаданных:
//   РегистрСведений.КИИ_МониторингОшибокЖурнал (измерение: ХешОшибки Строка 32)
//   РегистрСведений.КИИ_МониторингОшибокСтатистика (периодичность: День)
//   РегламентноеЗадание.КИИ_МониторингОшибокСборОшибок → ВыполнитьСборОшибок()
//   РегламентноеЗадание.КИИ_МониторингОшибокАнализИИ  → ВыполнитьАнализИИ()
//   РегламентноеЗадание.КИИ_МониторингОшибокОчистка   → ВыполнитьОчисткуДанных()
//
// Ресурсы регистра КИИ_МониторингОшибокЖурнал:
//   ПерваяДатаВремя, ПоследнееВхождение (Дата)
//   КоличествоПовторений, КоличествоОтправок (Число)
//   ТекстОшибки, Событие, Пользователь, Компьютер, Метаданные (Строка)
//   Критичность (ПеречислениеСсылка.КИИ_УровниКритичности)
//   ОписаниеОтИИ (Строка 2000)
//   ТребуетАнализа, ПроанализированаИИ, ОшибкаАнализаИИ (Булево)
//   ОтправленаВТелеграм, Игнорировать (Булево)
//   ДатаПоследнейОтправки (Дата)
//
// Ресурсы регистра КИИ_МониторингОшибокСтатистика (star-schema, аудит P2 #2; периодичность: День):
//   Измерение: ХешОшибки (Строка 32)
//   Ресурс: Количество (Число). Критичность/тип НЕ хранятся - берутся из Журнала джойном по ХешОшибки.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Тестовый seam: парсинг ответа ИИ (обертка приватной ПарситьОтветИИ; покрывает
// ИзвлечьJSONИзТекста + НормализоватьКритичность). Только для модульных тестов.
//
// Параметры:
//  ТекстОтвета - Строка - сырой текст ответа ИИ
//
// Возвращаемое значение:
//  Произвольный - результат парсинга (см. приватную ПарситьОтветИИ)
//
Функция ПарситьОтветИИДляТестов(ТекстОтвета) Экспорт
	Возврат КИИ_МониторингОшибокАнализ.ПарситьОтветИИ(ТекстОтвета);
КонецФункции

// Тестовый seam: нормализация уровня критичности (обертка приватной НормализоватьКритичность).
// Только для модульных тестов.
//
// Параметры:
//  ЗначениеСтр - Строка - строковое значение уровня критичности
//
// Возвращаемое значение:
//  Произвольный - нормализованный уровень критичности (см. приватную НормализоватьКритичность)
//
Функция НормализоватьКритичностьДляТестов(ЗначениеСтр) Экспорт
	Возврат КИИ_МониторингОшибокАнализ.НормализоватьКритичность(ЗначениеСтр);
КонецФункции

// Тестовый seam: подсчет критичностей для дайджеста (обертка приватной
// ПодсчитатьКритичностиДляДайджеста). Только для модульных тестов.
//
// Параметры:
//  МассивРезультатов - Массив из Структура - элементы с полем Критичность
//
// Возвращаемое значение:
//  Структура - счетчики по уровням критичности:
//   * Критическая - Число - число критических ошибок.
//   * Высокая - Число - число высоких ошибок.
//   * Средняя - Число - число средних ошибок.
//   * Низкая - Число - число низких ошибок.
//
Функция ПодсчитатьКритичностиДляДайджестаДляТестов(Знач МассивРезультатов) Экспорт
	Возврат КИИ_МониторингОшибокTelegram.ПодсчитатьКритичностиДляДайджеста(МассивРезультатов);
КонецФункции

// Тестовый seam: пакетный парсинг ответа ИИ (обертка приватной ПарситьПакетныйОтветИИ).
// Только для модульных тестов.
//
// Параметры:
//  ТекстОтвета     - Строка - сырой текст ответа ИИ (JSON-массив)
//  КоличествоОшибок - Число - число ошибок во входном пакете
//
// Возвращаемое значение:
//  Структура - результат пакетного парсинга:
//   * Успех - Булево - удалось ли распарсить.
//   * Результаты - Массив - элементы результата.
//   * ТекстОшибки - Строка - текст ошибки парсинга.
//
Функция ПарситьПакетныйОтветИИДляТестов(ТекстОтвета, КоличествоОшибок) Экспорт
	Возврат КИИ_МониторингОшибокАнализ.ПарситьПакетныйОтветИИ(ТекстОтвета, КоличествоОшибок);
КонецФункции

// Выполняет сбор ошибок из журнала регистрации.
// Вызывается регламентным заданием КИИ_МониторингОшибокСборОшибок.
// Использует сохраненную дату последнего сбора для непрерывного чтения.
// Поддерживает пагинацию для обработки больших объемов записей.
//
// Создает недостающие экземпляры регламентных заданий подсистемы и (опционально) включает их.
//
// Регламентные задания РАСШИРЕНИЯ не могут быть предопределенными - платформа не создает их
// экземпляры автоматически. Без этой процедуры мониторинг у клиента мертв из коробки:
// задания есть в метаданных, но в списке РегламентныеЗадания их нет.
// Идемпотентна: существующие задания не пересоздает и их расписание не трогает.
//
// Параметры:
//  Включить - Булево - Истина: созданные задания сразу активны.
//
// Возвращаемое значение:
//  Число - количество созданных заданий (0 - все уже были).
//
Функция ИнициализироватьРегламентныеЗадания(Знач Включить = Ложь) Экспорт

	ПериодСекунд = Новый Соответствие;
	ПериодСекунд.Вставить("КИИ_МониторингОшибокСборОшибок", 3600);   // сбор - раз в час
	ПериодСекунд.Вставить("КИИ_МониторингОшибокАнализИИ",   3600);   // анализ - следом за сбором
	ПериодСекунд.Вставить("КИИ_МониторингОшибокОчистка",    86400);  // очистка - раз в сутки

	Существующие = Новый Соответствие;
	Для Каждого Задание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
		Существующие.Вставить(Задание.Метаданные.Имя, Задание);
	КонецЦикла;

	Создано = 0;
	Для Каждого КлючИЗначение Из ПериодСекунд Цикл
		ИмяЗадания = КлючИЗначение.Ключ;
		СуществующееЗадание = Существующие[ИмяЗадания];
		Если СуществующееЗадание <> Неопределено Тогда
			// Задание уже есть: расписание пользователя НЕ трогаем, но при явном включении
			// активируем - иначе кнопка "Включить регламенты" ничего бы не делала и врала об успехе.
			Если Включить И НЕ СуществующееЗадание.Использование Тогда
				СуществующееЗадание.Использование = Истина;
				СуществующееЗадание.Записать();
			КонецЕсли;
			Продолжить;
		КонецЕсли;

		МетаданныеЗадания = Метаданные.РегламентныеЗадания.Найти(ИмяЗадания);
		Если МетаданныеЗадания = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);
		Расписание = Новый РасписаниеРегламентногоЗадания;
		Расписание.ПериодПовтораДней = 1;
		Расписание.ПериодПовтораВТечениеДня = КлючИЗначение.Значение;
		Задание.Расписание = Расписание;
		Задание.Использование = Включить;
		Задание.Записать();
		Создано = Создано + 1;
	КонецЦикла;

	Если Создано > 0 Тогда
		ПредставлениеИспользования = ?(Включить, НСтр("ru = 'включено'"), НСтр("ru = 'выключено'"));
		ТекстДляЖурнала = СтрШаблон(НСтр("ru = 'Создано регламентных заданий мониторинга: %1 (использование: %2)'"),
			Создано, ПредставлениеИспользования);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок'"),
			УровеньЖурналаРегистрации.Информация, , ,
			ТекстДляЖурнала);
	КонецЕсли;

	Возврат Создано;

КонецФункции

// Признак того, что регламентный сбор ошибок включен (задание существует и активно).
//
// Возвращаемое значение:
//  Булево - Истина, если сбор выполняется по расписанию.
//
Функция РегламентыВключены() Экспорт

	Для Каждого Задание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
		Если Задание.Метаданные.Имя = "КИИ_МониторингОшибокСборОшибок" Тогда
			Возврат Задание.Использование;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Состояние регламентных заданий мониторинга по отдельности (для индикатора на дашборде).
//
// Возвращаемое значение:
//  Структура:
//   * СборВключен   - Булево - задание сбора ошибок существует и используется.
//   * АнализВключен - Булево - задание анализа ИИ существует и используется.
//
Функция СостояниеРегламентов() Экспорт

	Состояние = Новый Структура("СборВключен, АнализВключен", Ложь, Ложь);
	Для Каждого Задание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
		Если Задание.Метаданные.Имя = "КИИ_МониторингОшибокСборОшибок" Тогда
			Состояние.СборВключен = Задание.Использование;
		ИначеЕсли Задание.Метаданные.Имя = "КИИ_МониторингОшибокАнализИИ" Тогда
			Состояние.АнализВключен = Задание.Использование;
		Иначе
			// Прочие регламентные задания базы к мониторингу не относятся - пропускаем.
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Возврат Состояние;

КонецФункции

// Собирает ошибки журнала регистрации в регистр мониторинга: читает ЖР за период с прошлого
// запуска по уровням из настроек, схлопывает одинаковые ошибки по хешу (повторные наращивают
// счетчик), помечает подавленные правилами игнорирования. Точка входа регламентного задания.
//
Процедура ВыполнитьСборОшибок() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();

	Попытка

		Настройки = ПолучитьНастройкиМониторинга();
		ТекущееВремя = ТекущаяДатаСеанса();

		ДатаПоследнего = КИИ_МониторингОшибокЖР.ПолучитьДатуПоследнегоСбора();
		Если НЕ ЗначениеЗаполнено(ДатаПоследнего) Тогда
			ДатаПоследнего = ТекущееВремя - 5 * 60;
		КонецЕсли;

		Усечено = Ложь;
		МассивОшибок = КИИ_МониторингОшибокЖР.ПрочитатьОшибкиИзЖурналаРегистрации(
			ДатаПоследнего, ТекущееВремя, Настройки, Усечено);

		Если МассивОшибок.Количество() = 0 Тогда
			КИИ_МониторингОшибокЖР.СохранитьДатуПоследнегоСбора(ТекущееВремя);
			Возврат;
		КонецЕсли;

		МаркерыТестов = Неопределено;
		Настройки.Свойство("МаркерыТестовыхПрогонов", МаркерыТестов);
		УникальныеОшибки = КИИ_МониторингОшибокЖР.ВыполнитьДедупликациюВПамяти(МассивОшибок, МаркерыТестов);
		КИИ_МониторингОшибокРегистры.ЗаписатьУникальныеОшибкиВРегистр(УникальныеОшибки);

		// При усечении (уперлись в лимит страниц) сдвигаем курсор только до последней ФАКТИЧЕСКИ
		// обработанной записи - иначе непрочитанный хвост периода терялся бы навсегда.
		// Следующий сбор дочитает его; перекрытие по дате безопасно - дубли схлопнет дедупликация.
		ДатаКурсора = ?(Усечено, ПоследняяДатаЗаписей(МассивОшибок, ДатаПоследнего), ТекущееВремя);
		КИИ_МониторингОшибокЖР.СохранитьДатуПоследнегоСбора(ДатаКурсора);

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Обработано %1 записей ЖР, найдено %2 уникальных ошибок'"),
			МассивОшибок.Количество(), УникальныеОшибки.Количество());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок.Сбор'"),
			УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);

	Исключение

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Критическая ошибка при сборе: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок.Сбор'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ВызватьИсключение;

	КонецПопытки;

КонецПроцедуры

// Выполняет пакетный анализ необработанных ошибок через ИИ
// и отправку уведомлений в Telegram (дайджест или индивидуально).
// Вызывается регламентным заданием КИИ_МониторингОшибокАнализИИ.
//
Процедура ВыполнитьАнализИИ() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();

	Попытка

		Настройки = ПолучитьНастройкиМониторинга();

		Если НЕ ЗначениеЗаполнено(Настройки.МодельДляАнализа) Тогда
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.МониторингОшибок.АнализИИ'"),
				УровеньЖурналаРегистрации.Предупреждение, , ,
				НСтр("ru = 'Модель ИИ не настроена. Анализ пропущен.'"));
			Возврат;
		КонецЕсли;

		Проанализировано = КИИ_МониторингОшибокАнализ.АнализироватьНовыеОшибки(Настройки);
		Повторных        = КИИ_МониторингОшибокАнализ.ПроверитьИОтправитьПовторныеОшибки(Настройки);

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Проанализировано новых: %1, отправлено повторных: %2'"),
			Проанализировано, Повторных);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок.АнализИИ'"),
			УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);

	Исключение

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Критическая ошибка при анализе: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок.АнализИИ'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ВызватьИсключение;

	КонецПопытки;

КонецПроцедуры

// Выполняет очистку устаревших данных мониторинга.
// Вызывается регламентным заданием КИИ_МониторингОшибокОчистка.
//
Процедура ВыполнитьОчисткуДанных() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();

	Попытка

		Настройки = ПолучитьНастройкиМониторинга();
		ПороговаяДата = НачалоДня(ТекущаяДатаСеанса()) - Настройки.СрокХраненияДней * 86400;

		УдаленоЖурнал     = КИИ_МониторингОшибокРегистры.ОчиститьРегистрЖурнала(ПороговаяДата);
		УдаленоСтатистика = КИИ_МониторингОшибокРегистры.ОчиститьРегистрСтатистики(ПороговаяДата);
		УдаленоЛог        = КИИ_МониторингОшибокРегистры.ОчиститьРегистрЛогаИИ(ПороговаяДата);

		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Очистка завершена. Удалено: журнал %1, статистика %2, лог ИИ %3'"),
			УдаленоЖурнал, УдаленоСтатистика, УдаленоЛог);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок.Очистка'"),
			УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);

	Исключение

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка при очистке данных: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок.Очистка'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

	КонецПопытки;

КонецПроцедуры

// Получает настройки подсистемы мониторинга из хранилища общих настроек.
// Токены Telegram читаются из БезопасногоХранилища с автоматической миграцией.
//
// Возвращаемое значение:
//   Структура - настройки подсистемы:
//    * УровниОшибокЖР - Массив из Строка - уровни ЖР для мониторинга
//    * МодельДляАнализа - Строка, Неопределено - идентификатор модели ИИ
//    * ШаблонПромптаСистемный - Строка - системный промпт для ИИ
//    * ШаблонПромптаПользовательский - Строка - пользовательский промпт для ИИ
//    * ТокенБотаТелеграм - Строка - токен Telegram-бота
//    * ChatIDТелеграм - Строка - идентификатор Telegram-чата
//    * ПорогОтправкиВТелеграм - Число - минимальное количество вхождений для отправки
//    * ПериодПорогаМинуты - Число - период порога в минутах
//    * МаксимумОтправокВТелеграм - Число - предел повторных уведомлений об одной ошибке (0 - без лимита)
//    * МаксимальноОшибокНаАнализ - Число - максимум ошибок на один цикл анализа
//    * РазмерСтраницыЖурнала - Число - размер страницы при чтении ЖР
//    * РазмерПакетаАнализаИИ - Число - размер пакета для батч-анализа ИИ
//    * СрокХраненияДней - Число - срок хранения данных в днях
//    * РежимДайджеста - Булево - Истина для отправки дайджеста вместо отдельных сообщений
//
Функция ПолучитьНастройкиМониторинга() Экспорт

	Настройки = НастройкиПоУмолчанию();
	ТребуетсяЗакрепитьМиграцию = Ложь;

	Попытка
		Сохраненные = ПрочитатьНастройкиИзКонстант();
		Если Сохраненные = Неопределено Тогда
			// До первого сохранения - подхватываем персональные настройки прежних версий
			Сохраненные = ПрочитатьУстаревшиеНастройки();
			ТребуетсяЗакрепитьМиграцию = (Сохраненные <> Неопределено);
		КонецЕсли;

		ПрименитьСохраненныеНастройки(Настройки, Сохраненные);
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось загрузить настройки. Используются значения по умолчанию.'")
			+ " " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;

	// Модель читается НЕЗАВИСИМО от JSON-константы: она хранится отдельно, и порча JSON
	// (правка админом через "Все функции") не должна ронять анализ вместе с настройками.
	МодельИзКонстанты = Константы.КИИ_МониторингОшибокМодельАнализа.Получить();
	Если ЗначениеЗаполнено(МодельИзКонстанты) Тогда
		Настройки.МодельДляАнализа = МодельИзКонстанты;
	КонецЕсли;

	КИИ_МониторингОшибокTelegram.ВыполнитьМиграциюТокеновТелеграм(Настройки);

	// Закрепляем миграцию в константах СРАЗУ: иначе персональные настройки администратора
	// так и остались бы персональными - регламентное задание под служебным пользователем
	// снова получило бы пустую константу и откатилось на значения по умолчанию.
	// ⚠ Строго ПОСЛЕ ВыполнитьМиграциюТокеновТелеграм: сохранение с ПУСТЫМ токеном означает
	// команду "удалить токен из хранилища" - до подстановки токенов оно стерло бы телеграм-канал.
	// В JSON-константу токены не попадают (СохранитьНастройкиМониторинга их обнуляет).
	Если ТребуетсяЗакрепитьМиграцию Тогда
		Попытка
			СохранитьНастройкиМониторинга(Настройки);
		Исключение
			// Нет прав на запись константы (например, у служебного пользователя) - не критично:
			// настройки текущего сеанса корректны, миграция закрепится при первом сохранении.
			// Уровень "Ошибка" поднял бы это в мониторинг (он собирает ЖР строго по нему) и в телеграм.
			// BSLLS:UsageWriteLogEvent-off
			ТекстДляЖурнала = НСтр("ru = 'Не удалось закрепить миграцию настроек в константах.'")
				+ " " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.МониторингОшибок'"),
				УровеньЖурналаРегистрации.Предупреждение, , ,
				ТекстДляЖурнала);
			// BSLLS:UsageWriteLogEvent-on
		КонецПопытки;
	КонецЕсли;

	Возврат Настройки;

КонецФункции

// Сохраняет настройки подсистемы мониторинга.
// Токены Telegram сохраняются в БезопасноеХранилище, остальное - в ХранилищеОбщихНастроек.
//
// Параметры:
//   Настройки - Структура - см. ПолучитьНастройкиМониторинга()
//
Процедура СохранитьНастройкиМониторинга(Настройки) Экспорт

	// Различаем "поле не передано" (ключа нет - хранилище не трогаем) и "передано пустым"
	// (админ очистил токен - надо УДАЛИТЬ его из хранилища). Прежний guard ЗначениеЗаполнено
	// делал очистку невозможной: поле на форме пустело, а уведомления продолжали уходить
	// старому получателю, потому что токен оставался в безопасном хранилище.
	ЗначениеТокена = Неопределено;
	Если Настройки.Свойство("ТокенБотаТелеграм", ЗначениеТокена) Тогда
		КИИ_МониторингОшибокTelegram.СохранитьТокенТелеграмВХранилище(ЗначениеТокена);
	КонецЕсли;

	ЗначениеЧата = Неопределено;
	Если Настройки.Свойство("ChatIDТелеграм", ЗначениеЧата) Тогда
		КИИ_МониторингОшибокTelegram.СохранитьChatIDТелеграмВХранилище(ЗначениеЧата);
	КонецЕсли;

	НастройкиДляСохранения = Новый Структура;
	Для Каждого Элемент Из Настройки Цикл
		Если Элемент.Ключ = "ТокенБотаТелеграм" ИЛИ Элемент.Ключ = "ChatIDТелеграм" Тогда
			НастройкиДляСохранения.Вставить(Элемент.Ключ, "");
		Иначе
			НастройкиДляСохранения.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;

	Попытка
		ЗаписатьНастройкиВКонстанты(НастройкиДляСохранения);
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка сохранения настроек: %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.МониторингОшибок'"),
			УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Вычисляет MD5-хеш строки.
//
// Параметры:
//   Текст - Строка
//
// Возвращаемое значение:
//   Строка - хеш (32 символа, нижний регистр)
//
Функция ВычислитьMD5(Текст) Экспорт
	Возврат КИИ_МониторингОшибокЖР.ВычислитьMD5(Текст);
КонецФункции

// Пересчитывает хеши всех ошибок Журнала по актуальному правилу
// (событие + нормализованный текст, см. КИИ_МониторингОшибокЖР.ВычислитьХешОшибки)
// со слиянием дублей и переносом Статистики на новые ключи.
// Одноразовая миграция после смены правила хеширования; повторный запуск безопасен.
//
Процедура ПересчитатьХешиОшибок() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ж.ХешОшибки КАК ХешОшибки,
	|	Ж.ТекстОшибки КАК ТекстОшибки,
	|	Ж.Событие КАК Событие,
	|	Ж.Пользователь КАК Пользователь,
	|	Ж.Компьютер КАК Компьютер,
	|	Ж.Метаданные КАК Метаданные,
	|	Ж.ОписаниеОтИИ КАК ОписаниеОтИИ,
	|	Ж.ПерваяДатаВремя КАК ПерваяДатаВремя,
	|	Ж.ПоследнееВхождение КАК ПоследнееВхождение,
	|	Ж.КоличествоПовторений КАК КоличествоПовторений,
	|	Ж.КоличествоОтправок КАК КоличествоОтправок,
	|	Ж.Критичность КАК Критичность,
	|	Ж.ТребуетАнализа КАК ТребуетАнализа,
	|	Ж.ПроанализированаИИ КАК ПроанализированаИИ,
	|	Ж.ОшибкаАнализаИИ КАК ОшибкаАнализаИИ,
	|	Ж.ОтправленаВТелеграм КАК ОтправленаВТелеграм,
	|	Ж.Игнорировать КАК Игнорировать,
	|	Ж.ДатаПоследнейОтправки КАК ДатаПоследнейОтправки
	|ИЗ
	|	РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Ж";
	Выборка = Запрос.Выполнить().Выбрать();

	КартаХешей = Новый Соответствие;
	Группы = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		НовыйХеш = КИИ_МониторингОшибокЖР.ВычислитьХешОшибки(Выборка.Событие, Выборка.ТекстОшибки);
		КартаХешей.Вставить(Выборка.ХешОшибки, НовыйХеш);
		Группа = Группы[НовыйХеш];
		Если Группа = Неопределено Тогда
			Группа = Новый Массив;
			Группы.Вставить(НовыйХеш, Группа);
		КонецЕсли;
		Слепок = Новый Структура("ХешОшибки, ТекстОшибки, Событие, Пользователь, Компьютер, Метаданные,
			|ОписаниеОтИИ, ПерваяДатаВремя, ПоследнееВхождение, КоличествоПовторений, КоличествоОтправок,
			|Критичность, ТребуетАнализа, ПроанализированаИИ, ОшибкаАнализаИИ, ОтправленаВТелеграм,
			|Игнорировать, ДатаПоследнейОтправки");
		ЗаполнитьЗначенияСвойств(Слепок, Выборка);
		Группа.Добавить(Слепок);
	КонецЦикла;

	НачатьТранзакцию();
	Попытка

		Для Каждого ПараХешей Из КартаХешей Цикл
			Если ПараХешей.Ключ = ПараХешей.Значение Тогда
				Продолжить;
			КонецЕсли;
			НаборСтарый = РегистрыСведений.КИИ_МониторингОшибокЖурнал.СоздатьНаборЗаписей();
			НаборСтарый.Отбор.ХешОшибки.Установить(ПараХешей.Ключ);
			НаборСтарый.Записать();
		КонецЦикла;

		Для Каждого ПараГруппы Из Группы Цикл
			Слитая = СлитьЗаписиЖурнала(ПараГруппы.Значение);
			Набор = РегистрыСведений.КИИ_МониторингОшибокЖурнал.СоздатьНаборЗаписей();
			Набор.Отбор.ХешОшибки.Установить(ПараГруппы.Ключ);
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Слитая);
			Запись.ХешОшибки = ПараГруппы.Ключ;
			Набор.Записать();
		КонецЦикла;

		ПеренестиСтатистикуНаНовыеХеши(КартаХешей);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Накатывает сохраненные значения на структуру настроек по умолчанию.
// Неизвестные поля и значения с несовпадающим типом игнорируются.
Процедура ПрименитьСохраненныеНастройки(Настройки, Знач Сохраненные)

	Если ТипЗнч(Сохраненные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Элемент Из Сохраненные Цикл
		ЗначениеПоУмолчанию = Неопределено;
		Если НЕ Настройки.Свойство(Элемент.Ключ, ЗначениеПоУмолчанию) Тогда
			Продолжить; // Неизвестное поле (настройка из будущей версии) - игнорируем
		КонецЕсли;
		// Тип из JSON должен совпадать с типом значения по умолчанию: испорченная руками
		// константа (например "УровниОшибокЖР": "Ошибка" вместо массива) иначе роняла
		// бы сбор на "Для Каждого" по строке. Несовпало - остается значение по умолчанию.
		Если ЗначениеПоУмолчанию <> Неопределено
			И ТипЗнч(Элемент.Значение) <> ТипЗнч(ЗначениеПоУмолчанию) Тогда
			Продолжить;
		КонецЕсли;
		Настройки[Элемент.Ключ] = Элемент.Значение;
	КонецЦикла;

КонецПроцедуры

// Сливает записи Журнала одного нормализованного класса в одну: счетчики
// суммируются, даты объединяются, представителем становится запись
// с анализом ИИ либо самая свежая.
//
// Параметры:
//  Записи - Массив из Структура - слепки записей регистра.
//
// Возвращаемое значение:
//  Структура - поля слитой записи.
//
Функция СлитьЗаписиЖурнала(Знач Записи)

	Итог = Записи[0];
	Для Индекс = 1 По Записи.Количество() - 1 Цикл
		Текущая = Записи[Индекс];
		СуммаПовторений = Итог.КоличествоПовторений + Текущая.КоличествоПовторений;
		СуммаОтправок = Итог.КоличествоОтправок + Текущая.КоличествоОтправок;
		ПерваяДата = Мин(Итог.ПерваяДатаВремя, Текущая.ПерваяДатаВремя);
		Игнор = Итог.Игнорировать Или Текущая.Игнорировать;
		Требует = Итог.ТребуетАнализа Или Текущая.ТребуетАнализа;
		Проанализирована = Итог.ПроанализированаИИ Или Текущая.ПроанализированаИИ;
		// Представителем класса становится текущая запись, если у нее есть анализ ИИ (а у итога нет),
		// либо при равном признаке анализа - более свежая; иначе остается накопленный Итог.
		ТекущаяПобеждает = (Текущая.ПроанализированаИИ И Не Итог.ПроанализированаИИ)
			Или (Текущая.ПроанализированаИИ = Итог.ПроанализированаИИ
				И Текущая.ПоследнееВхождение > Итог.ПоследнееВхождение);
		Если ТекущаяПобеждает Тогда
			Итог = Текущая;
		КонецЕсли;
		Итог.КоличествоПовторений = СуммаПовторений;
		Итог.КоличествоОтправок = СуммаОтправок;
		Итог.ПерваяДатаВремя = ПерваяДата;
		Итог.Игнорировать = Игнор;
		Итог.ТребуетАнализа = Требует;
		Итог.ПроанализированаИИ = Проанализирована;
	КонецЦикла;

	Возврат Итог;

КонецФункции

// Переносит Статистику на новые хеши с суммированием совпавших ключей.
//
// Параметры:
//  КартаХешей - Соответствие из КлючИЗначение - старый хеш и новый хеш.
//
Процедура ПеренестиСтатистикуНаНовыеХеши(Знач КартаХешей)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	С.Период КАК Период,
	|	С.ХешОшибки КАК ХешОшибки,
	|	С.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.КИИ_МониторингОшибокСтатистика КАК С";
	Выборка = Запрос.Выполнить().Выбрать();

	Суммы = Новый Соответствие;
	КОчистке = Новый Массив;
	Пока Выборка.Следующий() Цикл
		НовыйХеш = КартаХешей[Выборка.ХешОшибки];
		Если НовыйХеш = Неопределено Тогда
			НовыйХеш = Выборка.ХешОшибки;
		КонецЕсли;
		Если НовыйХеш <> Выборка.ХешОшибки Тогда
			Пара = Новый Структура("Период, Хеш", Выборка.Период, Выборка.ХешОшибки);
			КОчистке.Добавить(Пара);
		КонецЕсли;
		КлючНовый = Формат(Выборка.Период, "ДФ=yyyyMMdd") + "#" + НовыйХеш;
		Накоплено = Суммы[КлючНовый];
		Если Накоплено = Неопределено Тогда
			Накоплено = Новый Структура("Период, Хеш, Количество", Выборка.Период, НовыйХеш, 0);
			Суммы.Вставить(КлючНовый, Накоплено);
		КонецЕсли;
		Накоплено.Количество = Накоплено.Количество + Выборка.Количество;
	КонецЦикла;

	Для Каждого Пара Из КОчистке Цикл
		Набор = РегистрыСведений.КИИ_МониторингОшибокСтатистика.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Пара.Период);
		Набор.Отбор.ХешОшибки.Установить(Пара.Хеш);
		Набор.Записать();
	КонецЦикла;

	Для Каждого ПараСуммы Из Суммы Цикл
		Набор = РегистрыСведений.КИИ_МониторингОшибокСтатистика.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ПараСуммы.Значение.Период);
		Набор.Отбор.ХешОшибки.Установить(ПараСуммы.Значение.Хеш);
		Запись = Набор.Добавить();
		Запись.Период = ПараСуммы.Значение.Период;
		Запись.ХешОшибки = ПараСуммы.Значение.Хеш;
		Запись.Количество = ПараСуммы.Значение.Количество;
		Набор.Записать();
	КонецЦикла;

КонецПроцедуры

#Область Утилиты

Функция НастройкиПоУмолчанию()

	Настройки = Новый Структура;
	// Версия схемы JSON-настроек: при чтении старого снимка недостающие поля дополняются
	// дефолтами, а это поле позволит будущим версиям выполнять направленные миграции.
	Настройки.Вставить("ВерсияСхемыНастроек",             2);
	Настройки.Вставить("МодельДляАнализа",                Неопределено);
	Настройки.Вставить("ШаблонПромптаСистемный",          ПолучитьСистемныйПромптПоУмолчанию());
	Настройки.Вставить("ШаблонПромптаПользовательский",   ПолучитьПользовательскийПромптПоУмолчанию());
	Настройки.Вставить("ТокенБотаТелеграм",               "");
	Настройки.Вставить("ChatIDТелеграм",                  "");
	Настройки.Вставить("ПорогОтправкиВТелеграм",          3);
	Настройки.Вставить("ПериодПорогаМинуты",              60);
	// Мьют повторных уведомлений после N отправок одной ошибки (антиспам). 0 - без лимита.
	Настройки.Вставить("МаксимумОтправокВТелеграм",       10);
	Настройки.Вставить("МаксимальноОшибокНаАнализ",       10);
	Настройки.Вставить("РазмерСтраницыЖурнала",           1000);
	Настройки.Вставить("РазмерПакетаАнализаИИ",           5);
	Настройки.Вставить("СрокХраненияДней",                30);
	Настройки.Вставить("РежимДайджеста",                  Истина);
	// Коробочный fail-closed: запросы к ДАННЫМ (execute_query) в глубоком анализе выключены,
	// пока владелец базы явно не разрешит. Метаданные-инструменты доступны всегда.
	Настройки.Вставить("РазрешитьЗапросыКДанным",         Ложь);

	УровниПоУмолчанию = Новый Массив;
	УровниПоУмолчанию.Добавить("Ошибка");
	Настройки.Вставить("УровниОшибокЖР", УровниПоУмолчанию);

	Настройки.Вставить("МаркерыТестовыхПрогонов",
		КИИ_МониторингОшибокЖР.МаркерыТестовыхПрогоновПоУмолчанию());

	Возврат Настройки;

КонецФункции

// Текст общего макета либо фолбэк: пустой или удаленный макет не должен ронять мониторинг,
// поэтому встроенные тексты промптов остаются страховкой.
//
// Параметры:
//  ИмяМакета - Строка - имя общего макета (TextDocument).
//  Фолбэк    - Строка - встроенный текст на случай отсутствия/пустоты макета.
//
// Возвращаемое значение:
//  Строка - текст промпта.
//
Функция ТекстМакетаИлиФолбэк(Знач ИмяМакета, Знач Фолбэк) Экспорт

	Попытка
		Текст = ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();
		Если Не ПустаяСтрока(Текст) Тогда
			Возврат Текст;
		КонецЕсли;
	Исключение
		// Макет удален или недоступен - работаем на встроенном тексте, но факт фиксируем:
		// молчаливый фолбэк скрывал бы то, что промпт взят не из макета, а из кода.
		// Уровень осознанно Предупреждение, не Ошибка: мониторинг собирает уровень "Ошибка",
		// и штатный фолбэк промпта начал бы отправлять сам себя в Телеграм.
		// BSLLS:UsageWriteLogEvent-off
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстДляЖурнала = СтрШаблон(НСтр("ru = 'Макет ""%1"" недоступен, используется встроенный текст. %2'"),
			ИмяМакета, ПредставлениеОшибки);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'КИИ.МониторингОшибок'"),
			УровеньЖурналаРегистрации.Предупреждение, , ИмяМакета, ТекстДляЖурнала);
		// BSLLS:UsageWriteLogEvent-on
	КонецПопытки;
	Возврат Фолбэк;

КонецФункции

Функция ПолучитьСистемныйПромптПоУмолчанию()

	Возврат ТекстМакетаИлиФолбэк("КИИ_ПромптМониторингаСистемный", ВстроенныйСистемныйПромпт());

КонецФункции

Функция ВстроенныйСистемныйПромпт()

	Возврат
	"Ты - эксперт по 1С:Предприятие. Проанализируй ошибку из журнала регистрации.
	|
	|Критерии критичности:
	|- Низкая: информационные, не влияют на работу
	|- Средняя: предупреждения, могут создавать неудобства
	|- Высокая: ошибки, нарушающие бизнес-процессы
	|- Критическая: блокирующие (deadlock, потеря данных, access violation)
	|
	|ВАЖНО: Верни ТОЛЬКО JSON без дополнительного текста:
	|{
	|  ""критичность"": ""Низкая|Средняя|Высокая|Критическая"",
	|  ""описание"": ""Краткое описание и рекомендация (до 200 слов)""
	|}";

КонецФункции

Функция ПолучитьПользовательскийПромптПоУмолчанию()

	Возврат ТекстМакетаИлиФолбэк("КИИ_ПромптМониторингаПользовательский", ВстроенныйПользовательскийПромпт());

КонецФункции

Функция ВстроенныйПользовательскийПромпт()

	Возврат
	"Данные ошибки из 1С:
	|- Дата/время: {ДатаВремя}
	|- Событие: {Событие}
	|- Пользователь: {Пользователь}
	|- Компьютер: {Компьютер}
	|- Метаданные: {Метаданные}
	|
	|Текст ошибки:
	|{ТекстОшибки}";

КонецФункции

// Экспорт: вызывается кросс-модульно из КИИ_МониторингОшибокАнализ.СформироватьПакетныйПромптДляИИ.
// Без Экспорт вызов падал «метод не обнаружен» - латентный сбой пакетного анализа (аудит: паттерн
// «молчаливой смерти», путь не был прогнан).
// Возвращаемое значение:
//  Строка - системный промпт для пакетного анализа ошибок ИИ.
Функция ПолучитьСистемныйПромптПакетный() Экспорт

	Возврат
	"Ты - эксперт по 1С:Предприятие. Проанализируй пакет ошибок из журнала регистрации.
	|
	|Критерии критичности:
	|- Низкая: информационные, не влияют на работу
	|- Средняя: предупреждения, могут создавать неудобства
	|- Высокая: ошибки, нарушающие бизнес-процессы
	|- Критическая: блокирующие (deadlock, потеря данных, access violation)
	|
	|ВАЖНО: Верни ТОЛЬКО JSON-массив без дополнительного текста.
	|На каждую ошибку - один элемент массива:
	|[
	|  {""номер"": 1, ""критичность"": ""Низкая|Средняя|Высокая|Критическая"",
	|   ""описание"": ""Краткое описание и рекомендация (до 200 слов)""},
	|  {""номер"": 2, ""критичность"": ""..."", ""описание"": ""...""}
	|]";

КонецФункции

// Максимальная дата среди обработанных записей ЖР - курсор для продолжения усеченного сбора.
//
// Параметры:
//  МассивОшибок   - Массив из СтрокаТаблицыЗначений - обработанные записи ЖР.
//  ДатаПоследнего - Дата - дата, с которой шел текущий сбор.
//
// Возвращаемое значение:
//  Дата - дата последней обработанной записи (строго больше ДатаПоследнего).
//
Функция ПоследняяДатаЗаписей(Знач МассивОшибок, Знач ДатаПоследнего)

	Максимум = ДатаПоследнего;
	Для Каждого ЗаписьЖурнала Из МассивОшибок Цикл
		Если ЗаписьЖурнала.Дата > Максимум Тогда
			Максимум = ЗаписьЖурнала.Дата;
		КонецЕсли;
	КонецЦикла;

	// Защита от зацикливания: если все записи уместились в ту же секунду, что и старый курсор,
	// сбор читал бы один и тот же кусок вечно. Сдвигаем на секунду вперед - при 100 x РазмерСтраницы
	// записей в одной секунде часть все равно потеряется, но подсистема не встанет колом.
	Возврат ?(Максимум > ДатаПоследнего, Максимум, ДатаПоследнего + 1);

КонецФункции

// Читает настройки из констант (общие для всех пользователей и регламентных заданий).
// Ссылка на модель хранится отдельной константой: в JSON ее не сериализовать.
//
// Возвращаемое значение:
//  Структура, Неопределено - сохраненные настройки; Неопределено - константа еще не заполнена.
//
Функция ПрочитатьНастройкиИзКонстант()

	ЗначениеJSON = Константы.КИИ_МониторингОшибокНастройки.Получить();
	Если НЕ ЗначениеЗаполнено(ЗначениеJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Настройки = ОбщегоНазначения.JSONВЗначение(ЗначениеJSON, , Ложь);
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Модель здесь НЕ читаем: ее подставляет ПолучитьНастройкиМониторинга независимо от JSON.

	Возврат Настройки;

КонецФункции

// Записывает настройки в константы: скалярные значения - JSON-строкой, ссылку на модель - отдельно.
//
// Параметры:
//  Настройки - Структура - настройки для сохранения (см. ПолучитьНастройкиМониторинга).
//
Процедура ЗаписатьНастройкиВКонстанты(Знач Настройки)

	// ⚠ ОбщегоНазначения.ЗначениеВJSON ПАДАЕТ на Неопределено - такие поля не сериализуем
	// (при чтении подставится значение из НастройкиПоУмолчанию).
	// ⚠ Даты в JSON уходят строкой ISO и обратно строкой НЕ конвертируются - полей типа Дата
	// в настройках не держать (дата последнего сбора вынесена в отдельную константу).
	ДляJSON = Новый Структура;
	Для Каждого Элемент Из Настройки Цикл
		ТипЗначения = ТипЗнч(Элемент.Значение);
		Если Элемент.Ключ = "МодельДляАнализа"
			ИЛИ ТипЗначения = Тип("Неопределено")
			ИЛИ ТипЗначения = Тип("NULL") Тогда
			Продолжить;
		КонецЕсли;
		ДляJSON.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;

	Константы.КИИ_МониторингОшибокНастройки.Установить(ОбщегоНазначения.ЗначениеВJSON(ДляJSON));

	Модель = Неопределено;
	Настройки.Свойство("МодельДляАнализа", Модель);
	Если ТипЗнч(Модель) = Тип("СправочникСсылка.КИИ_МоделиИИ") Тогда
		Константы.КИИ_МониторингОшибокМодельАнализа.Установить(Модель);
	Иначе
		Константы.КИИ_МониторингОшибокМодельАнализа.Установить(
			Справочники.КИИ_МоделиИИ.ПустаяСсылка());
	КонецЕсли;

КонецПроцедуры

// Читает настройки прежних версий из персонального ХранилищаОбщихНастроек.
// Использовалось до перевода настроек на константы: значения были ПЕРСОНАЛЬНЫМИ -
// регламентное задание под служебным пользователем не видело настройки администратора.
//
// Возвращаемое значение:
//  Структура, Неопределено - настройки текущего пользователя либо Неопределено.
//
Функция ПрочитатьУстаревшиеНастройки()

	Попытка
		Сохраненные = ХранилищеОбщихНастроек.Загрузить("КИИ_МониторингОшибок_Настройки", "");
	Исключение
		Возврат Неопределено; // Настроек прежних версий нет
	КонецПопытки;

	Возврат ?(ТипЗнч(Сохраненные) = Тип("Структура"), Сохраненные, Неопределено);

КонецФункции

#КонецОбласти

#КонецОбласти
